In [1]:
import pandas as pd
df = pd.read_csv('data.csv')

In [2]:
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0

In [3]:
df['country'].describe()

count        956
unique         4
top       France
freq         408
Name: country, dtype: object

In [4]:
df['price_paid'].describe()

count      1000
unique      528
top       $3.73
freq          8
Name: price_paid, dtype: object

In [5]:
df.price_paid = df.price_paid.apply(lambda x: x.replace("$", ""))
df.price_paid = df.price_paid.astype(float)

In [6]:
df['price_paid'].mean()

6.461930000000001

In [7]:
df['price_paid'].sum()

6461.93

In [8]:
df['price_paid'].max()

10.0

value_counts() nous permet d'avoir le statistique général par exemple savoir le nombre de clients pour chaque pays

In [9]:
df['country'].value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [10]:
df['gender'].value_counts()

Female    493
Male      438
Name: gender, dtype: int64

In [12]:
df['gender'].value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

introduction avec groupby tres utile pour connaitre la globalité pour chaque pays

In [13]:
df.groupby("country").sum()

                   id  price_paid     tax
country
Canada          70365     1017.45  2160.0
France         214440     2619.61  5100.0
Morocco         26591      362.97   780.0
United States  168150     2183.67  4520.0

In [14]:
df.groupby(['gender', 'country']).mean()

                              id  price_paid   tax
gender country
Female Canada         461.472973    6.419324  20.0
       France         512.648241    6.350352  20.0
       Morocco        479.925926    7.024815  20.0
       United States  487.282353    6.437118  20.0
Male   Canada         406.000000    6.117467  20.0
       France         534.928177    6.498950  20.0
       Morocco        483.652174    6.146957  20.0
       United States  525.284722    6.672500  20.0

In [15]:
df.head()

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,9.24,20.0